---
type: ImportInstance
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ImportInstance

`Autodesk.Revit.DB.ImportInstance` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetVisibility | — | `public FamilyElementVisibility GetVisibility ()` |
| Method | SetVisibility | — | `public void SetVisibility ( FamilyElementVisibility visibility )` |
| Property | IsLinked | 2011 | `public bool IsLinked { get ; }` |
| Property | Parameter | — | `` |